// 04 Clever Lily.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
#include<sstream>
#include<string>

using namespace std;

#define EMPTY ""

string formatDoubleNum(double number, int precision)
{
    stringstream stream;

    stream.precision(precision);
    stream << fixed;

    stream << number;

    return stream.str();
}

int main()
{
    //Прочитане на входните данни от конзолата

    int ageLily, priceToy;
    double priceWashingMachine;
    cin >> ageLily >> priceWashingMachine >> priceToy;

    //Изчисляване на броя на четните и нечетни години
     //Броят на четните години са винаги кратни на 2 => могат да се получат като разделим целочислено годините на Лили на 2:
     // Ако Лили е на 0 години - значи броят на четните и години е 0
     // Ако Лили е на 1 година - значи броят на четните и години е 0
     // Ако Лили е на 2 години - значи броят на четните и години е 1
     // Ако Лили е на 3 години - значи броят на четните и години е 1
     // и т. н.

    int countEvenAges = ageLily / 2;

    //Броят на нечетните години са равни или с 1 по-големи от броя на четните => можем да ги получим чрез сбора на броя четни години и остатъкът от целочисленото деление на текущите години с 2:
    // Ако Лили е на 0 години - значи броят на нечетните и години е 0
    // Ако Лили е на 1 година - значи броят на нечетните и години е 1
    // Ако Лили е на 2 години - значи броят на нечетните и години е 1
    // Ако Лили е на 3 години - значи броят на нечетните и години е 2
    // и т. н.

    int countOddAges = countEvenAges + ageLily % 2;

    // На всяка четна годишнина Лили получава с 10 лв. повече отколкото от предходната четна годишнина (2 -> 10, 4 -> 20, 6 -> 30...и т.н.) или написано по друг начин:
    // Ако N е максималният брой на четните и годишнини, то търсим сумата на 1 * 10 + 2 * 10 + 3 * 10 + ... + N * 10
    // Като извадим 10 пред скоби се получава 10 * (1 + 2 + 3 + ... + N).
    // Сумата в скобите е аритметична прогресия, и от знанията ни от математиката знаем, че сумата на аритметична прогресия започваща от 1 и с общ член 1 е (1 + N).N / 2:
    // За първата годишнита сумата е 1
    // За втората годишнита сумата е 2
    // За третата - 6
    // За четвъртата 10
    // и т. н.
    // (Това, ако не се лъжа, се изучава в шести клас)

    int sumEvenAges = ((1 + countEvenAges) * countEvenAges) / 2;

    // Тогава всичките пари които Лили получава за четните си годишнини е:

    double evenMoney = sumEvenAges * 10;

    // От тези пари трябва да извадим по 1 лв. за всяка годишнина, което си е броят на четните и годишнини умножено по 1 лв.

    evenMoney -= countEvenAges * 1; // Единицата е за яснота, може да се пропусне

    // Парите от играчките са лесни - броят на нечетните годишнини умножен по цената за една играчка

    double oddMoney = countOddAges * priceToy;

    //Общата сума, която е спестила Лили е сумата от парите от четните и годишнини и парите от продажбата на играчките от нечетните и години

    double tottalMoney = evenMoney + oddMoney;

    // Остава да се провери дали сумата е достатъчна за да може Лили да си купи пералня или не e достатъчна и да изведем резултата на конзолата

    string output = EMPTY;

    double diff = tottalMoney - priceWashingMachine;

    if (diff >= 0)
    {
        output.append("Yes! ")
              .append(formatDoubleNum(diff, 2));
    }
    else
    {
        output.append("No! ")
              .append(formatDoubleNum(-diff, 2));
    }

    cout << output << endl;    
}

//Лили вече е на N години. За всеки свой рожден ден тя получава подарък. 
//•	За нечетните рождени дни (1, 3, 5...n) получава играчки.
//•	За четните рождени дни (2, 4, 6...n) получава пари.
//За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв., за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.). През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях. Лили продала играчките получени през годините, всяка за P лева и добавила сумата към спестените пари. С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.
//Вход
//Програмата прочита 3 числа, въведени от потребителя, на отделни редове:
//•	Възрастта на Лили - цяло число в интервала [1...77]
//•	Цената на пералнята - число в интервала [1.00...10 000.00]
//•	Единична цена на играчка - цяло число в интервала [0...40]
//Изход
//Да се отпечата на конзолата един ред:
//•	Ако парите на Лили са достатъчни:
//o "Yes! {N}" - където N е остатъка пари след покупката
//•	Ако парите не са достатъчни:
//o "No! {М}" - където M е сумата, която не достига
//Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.